
import 'dart:developer';

import 'person.dart';

void main() {
  //(Название класса) (название объекта) = (название конструктора);
  Person person = Person("Iron-Man", 47, "Богатый умный");
  Person person2 = Person("Ronaldo", 41, "Патриот");

  //(Тип данных) (название переменной) = (значание переменной);
  String www = "Geeks";

  person.printInfo();
  print("------------------------");
  person2.printInfo();
}

// ООП - объектно-ориентированное программирование
// 1. Инкапсуляция - сокрытие данных и методов внутри класса
// 2. Полиморфизм - способность объекта принимать разные формы
// 3. Наследование - способность объекта наследовать свойства и методы другого объекта
// 4. Абстракция - способность объекта скрывать детали реализации и 
// предоставлять только необходимый интерфейс
